Repository: netrunner-debian-kde-extras/keurocalc
Catalog: doc/*.po
Languages: de, pt_br, uk

source: Press the <guibutton>+</guibutton> button or the <keycap>+</keycap> key.
de: Drücken Sie den Knopf <guibutton>+</guibutton> oder die Taste <keycap>+</keycap>.
pt_br: Pressione o botão <guibutton>+</guibutton> ou a tecla <keycap>+</keycap>.
uk: Натисніть кнопку <guibutton>+</guibutton> або клавішу <keycap>+</keycap>.

source: Look at the result: 26.96 € or 3600 ¥ at the time of writing.
de: Als Ergebnis wird 26,96 € or 3600 ¥ angezeigt.
pt_br: Olhe para o resultado: 26,96 € ou 3 600 ¥ no momento da escrita.
uk: Погляньте на результат: 26.96 € або 3600 ¥ на час написання цього підручника.

source: How much is 3000 yen minus 20%?
de: Wieviel ist 3000 Yen minus 20%?
pt_br: Quanto é 3 000 ienes menos 20%?
uk: Скільки буде 3000 єн мінус 20%?

source: Press the <guibutton>-</guibutton> button or <keycap>-</keycap> key.
de: Drücken Sie den Knopf <guibutton>-</guibutton> oder die Taste <keycap>-</keycap>.
pt_br: Pressione o botão <guibutton>-</guibutton> ou a tecla <keycap>-</keycap>.
uk: Натисніть кнопку <guibutton>-</guibutton> або клавішу <keycap>-</keycap>.

source: Look at the result: 17.97 € or 2400 ¥ at the date of writing these lines.
de: Als Ergebnis wird 17,97 € oder 2400 ¥ angezeigt.
pt_br: Olhe para o resultado: 17,97 € ou 2 400 ¥ no momento em que este documento foi escrito.
uk: Погляньте на результат: 17.97 € або 2400 ¥ на час написання цього підручника.

source: Using Intermediate Memory
de: Zwischenspeicher verwenden
pt_br: Usar a Memória Intermediária
uk: Використання проміжної пам’яті

source: How do I store now and recall later some value?
de: Wie kann ich einen Wert speichern und später wieder verwenden?
pt_br: Como eu registro agora e utilizo de novo mais tarde um determinado valor?
uk: Як зберегти, а потім скористатися певним значенням?

source: Do your computations.
de: Führen Sie Ihre Berechnungen durch.
pt_br: Faça os seus cálculos.
uk: Виконайте певні розрахунки.

source: Press <guibutton>Min</guibutton> (Memory in) button to store the value in the <guilabel>Result</guilabel> area. Please notice that the other memory keys now become available.
de: Drücken Sie den Knopf <guibutton>Min</guibutton> (Memory in), um den Wert des Feldes <guilabel>Ergebnis</guilabel> zu speichern. Beachten Sie dass dann auch die anderen Knöpfe für den Zwischenspeicher aktiviert werden.
pt_br: Pressione <guibutton>Min</guibutton> (Memory in - colocar na memória) para guardar o valor do campo <guilabel>Resultado</guilabel>. Repare agora que as outras teclas de memória ficarão disponíveis.
uk: Натисніть кнопку <guibutton>Min</guibutton> (Memory in), щоб зберегти значення у полі <guilabel>Результат</guilabel>. Будь ласка, зауважте, що після цього стануть доступними інші клавіші, призначені для роботи з пам’яттю.

source: Do some other work with the calculator.
de: Arbeiten Sie weiter mit dem Rechner.
pt_br: Faça outro trabalho qualquer com a calculadora.
uk: Виконайте інше завдання на калькуляторі.

source: Recall the value from the memory by pressing the <guibutton>MR</guibutton> (Memory Recall) button.
de: Holen Sie den Wert aus dem Speicher mit dem Knopf <guibutton>MR</guibutton> (Memory Recall) zurück.
pt_br: Relembre o valor em memória pressionando o botão <guibutton>MR</guibutton> (Memory Recall - Ler da Memória).
uk: Виведіть значення з пам’яті натисканням кнопки <guibutton>MR</guibutton> (Memory Recall).

source: Internally, the values are recalled with no unit or in the reference currency (euro) with the maximum precision allowed by the mathematical library. In some rare cases, this might lead to rounding problems if the stored value is a rounded value in a non-reference currency.
de: Intern werden die Werte ohne Einheit oder Bezugswährung mit der maximalen Genauigkeit der mathematischen Bibliothek zurückgeholt. In einigen seltenen Fällen kann dies zu Rundungsproblemen führen, wenn der gespeicherte Wert ein gerundeter Wert mit nicht referenzierter Währung ist.
pt_br: Internamente, os valores são lidos da memória sem nenhuma unidade ou referência a moeda (euro) com a máxima precisão permitida pela biblioteca matemática. Em alguns casos raros, isto pode levar a problemas de arredondamento se o valor armazenado for um valor arredondado numa moeda sem referência.
uk: У внутрішньому форматі значення зберігаються без символів величини або у грошових одиницях (євро) з максимальною точністю, яку підтримує математична бібліотека. У деяких рідкісних випадках подібний формат зберігання може призвести до проблем з округленням, якщо збережене значення є значенням з округленням у неосновній валюті.

source: How do I clear the memory?
de: Wie lösche ich den Speicher?
pt_br: Como eu limpo a memória?
uk: Як спорожнити пам’ять?

source: Press the <guibutton>Reset</guibutton> button. Please notice that the <guibutton>Reset</guibutton> clears everything: the input, the result and the memory.
de: Drücken Sie den Knopf <guibutton>Zurücksetzen</guibutton>. Beachten Sie, dass damit alles gelöscht wird: Die Eingabe, das Ergebnis und der Zwischenspeicher.
pt_br: Pressione o botão <guibutton>Reiniciar</guibutton>. Repare que o <guibutton>Reiniciar</guibutton> limpa tudo: os dados inseridos, o resultado e a memória.
uk: Натисніть кнопку <guibutton>Скинути</guibutton>. Будь ласка, зауважте, що натискання кнопки <guibutton>Скинути</guibutton> призведе до спорожнення всіх полів: вводу, результату і пам’яті.

source: How do I compute 3.1 * 5.2 € + 2.7 * 8.9 €?
de: Wie berechne ich 3.1 * 5.2 € + 2.7 * 8.9 €?
pt_br: Como se calcula 3,1 * 5,2 € + 2,7 * 8,9 €?
uk: Як обчислити 3.1 * 5.2 € + 2.7 * 8.9 €?

source: First compute the first half: <userinput>3.1 * 5.2 €</userinput>.
de: Berechnen Sie zuerst den ersten Teil: <userinput>3.1 * 5.2 €</userinput>.
pt_br: Primeiro calcule a primeira metade: <userinput>3,1 * 5,2 €</userinput>.
uk: Спочатку обчисліть першу частину: <userinput>3.1 * 5.2 €</userinput>.

source: Store the result in memory with <guibutton>Min</guibutton> button.
de: Speichern Sie das Ergebnis mit dem Knopf <guibutton>Min</guibutton>.
pt_br: Guarde o resultado com o botão <guibutton>Min</guibutton>.
uk: Збережіть результат обчислень у пам’яті за допомогою кнопки <guibutton>Min</guibutton>.

source: Now compute the other half: <userinput>2.7 * 8.9 €</userinput>.
de: Berechnen Sie jetzt den zweiten Teil: <userinput>2.7 * 8.9 €</userinput>.
pt_br: Agora calcule a segunda metade: <userinput>2,7 * 8,9 €?</userinput>.
uk: Тепер обчисліть другу частину: <userinput>2.7 * 8.9 €</userinput>.

source: Add the result to the memory with <guibutton>M+</guibutton> button.
de: Fügen Sie das Ergebnis mit dem Knopf <guibutton>M+</guibutton> zum Speicher hinzu.
pt_br: Adicione o resultado à memória com o botão <guibutton>M+</guibutton>.
uk: Додайте результат до значення у пам’яті за допомогою натискання кнопки <guibutton>M+</guibutton>.

source: Recall the sum with <guibutton>MR</guibutton> button.
de: Holen Sie die Summe mit <guibutton>MR</guibutton> zurück.
pt_br: Recupere a soma com o botão <guibutton>MR</guibutton>.
uk: Викликати отриману суму можна за допомогою натискання кнопки <guibutton>MR</guibutton>.

source: There are other solutions like <userinput>3.1 * 5.2 € Min 2.7 * 8.9 € + MR</userinput>.
de: Es gibt andere Möglichkeiten wie <userinput>3,1 * 5,2 € Min 2,7 * 8,9 € + MR</userinput>.
pt_br: Existem outras soluções do tipo <userinput>3,1 * 5,2 € Min 2,7 * 8,9 €? + MR</userinput>.
uk: Існують і інші способи обчислення, наприклад: <userinput>3.1 * 5.2 € Min 2.7 * 8.9 € + MR</userinput>.

source: How do I compute 3.1 * 5.2 € - 2.7 * 8.9 €?
de: Wie berechne ich 3.1 * 5.2 € - 2.7 * 8.9 €?
pt_br: Como se calcula 3,1 * 5,2 € - 2,7 * 8,9 €?
uk: Як мені обчислити 3.1 * 5.2 € - 2.7 * 8.9 €?

source: Subtract the result from the memory with <guibutton>M-</guibutton> button.
de: Subtrahieren Sie das Ergebnis vom Zwischenspeicher mit dem Knopf <guibutton>M-</guibutton>.
pt_br: Subtraia o resultado da memória com o botão <guibutton>M-</guibutton>.
uk: Віднімайте результат від результату у пам’яті калькулятора за допомогою кнопки <guibutton>M-</guibutton>.

source: The sequence <userinput>3.1 * 5.2 € Min 2.7 * 8.9 € - MR</userinput> computes the difference in the reverse order.
de: Die Tastenfolge <userinput>3.1 * 5.2 € Min 2.7 * 8.9 € - MR</userinput> berechnet die Differenz in umgekehrter Reihenfolge.
pt_br: A sequência <userinput>3,1 * 5,2 € Min 2,7 * 8,9 €? - MR</userinput> calcula o resultado na ordem inversa.
uk: Послідовність натискань кнопок <userinput>3.1 * 5.2 € Min 2.7 * 8.9 € - MR</userinput> обчислить різницю у зворотному порядку.

source: Command Reference
de: Befehlsreferenz
pt_br: Referência de comandos
uk: Довідка щодо команд

source: Default Shortcuts
de: Standard-Tastenkürzel
pt_br: Atalhos padrão
uk: Типові клавіатурні скорочення

source: Exits from &keurocalc;
de: &keurocalc; beenden
pt_br: Sai do &keurocalc;
uk: Завершує роботу &keurocalc;

source: Displays these help pages
de: Zeigt dieses Handbuch an
pt_br: Mostra estas páginas de ajuda
uk: Показує ці сторінки довідки

source: Goes to the currency selection area
uk: Переводить вас до області вибору валют

source: Displays the <guilabel>About</guilabel> box
de: Zeigt den Dialog <guilabel>Über</guilabel> an
pt_br: Mostra a janela <guilabel>Sobre</guilabel>
uk: Показує панель <guilabel>Про програму</guilabel>

source: Input digits
de: Zifferneingabe
pt_br: Insere algarismos
uk: Введення цифр

source: <keycap>.</keycap> or <keycap>,</keycap>
de: <keycap>.</keycap> oder <keycap>,</keycap>
uk: <keycap>.</keycap> або <keycap>,</keycap>

source: Decimal separator
de: Dezimaltrennzeichen
pt_br: Separador decimal
uk: Відокремлюють цілу частину від дробової

source: <keycap>+</keycap>, <keycap>-</keycap>, <keycap>*</keycap> and <keycap>/</keycap>
uk: <keycap>+</keycap>, <keycap>-</keycap>, <keycap>*</keycap> і <keycap>/</keycap>

source: Operators: addition, subtraction, multiplication and division
de: Operatoren: Addition, Subtraktion, Multiplikation und Division.
pt_br: Operadores: soma, subtração, multiplicação e divisão
uk: Оператори: додавання, віднімання, множення і ділення

source: &Enter; and <keycap>Return</keycap>
de: &Enter; und <keycap>Rücktaste</keycap>
pt_br: &Enter; e <keycap>Return</keycap>
uk: &Enter; або <keycap>Return</keycap>

source: Validation of input number considered as a simple, unitless, value
de: Auswertung der eingegebenen Zahl als einfacher einheitenloser Wert
pt_br: Validação do número inserido como sendo um valor simples e sem unidade
uk: Визначення введеного числа, яка простого значення без величини

source: Validation of input number considered as a percentage
de: Auswertung der eingegebenen Zahl als Prozentwert
pt_br: Validação do número inserido como uma percentagem
uk: Визначення введеного числа як відсотків

source: Removal of last input: digits, decimal separator or operator
de: Entfernt das letzte eingegebene Zeichen: Ziffer, Dezimaltrennzeichen oder Operator
pt_br: Remoção do último dado inserido: algarismos, separador decimal ou operador
uk: Вилучення останнього введеного символу: цифри, десяткового роздільника або оператора

source: &Tab; and <keycombo action="simul">&Shift; &Tab;</keycombo> keys
de: Taste &Tab; und die Tastenkombination <keycombo action="simul">&Shift; &Tab;</keycombo>
pt_br: Teclas &Tab; e <keycombo action="simul">&Shift; &Tab;</keycombo>
uk: Клавіша &Tab; і комбінація клавіш <keycombo action="simul">&Shift; &Tab;</keycombo>

source: Moves from one button to the next or previous one
de: Geht zum nächsten oder vorherigen Knopf
pt_br: Move de um botão para o próximo ou para o anterior, respectivamente
uk: Пересування до наступної або попередньої кнопки

source: Arrow keys
de: Pfeiltasten
pt_br: Teclas de direção
uk: Клавіші зі стрілками

source: In the currency selection area, moves from one currency to the other
de: Wechselt im Auswahlfeld Währung von einer zur anderen Währung.
pt_br: Na área de seleção da moeda, muda de uma moeda para a outra
uk: У полі вибору валюти пересуває від одного пункту валюти до іншого

source: Space bar
de: Leertaste
pt_br: Barra de espaço
uk: Пробіл

source: When focus is on a push button, presses this button
de: Hat ein Knopf den Fokus, dann wird dieser Knopf gedrückt.
pt_br: Quando o foco está sobre um botão, pressione este botão
uk: Якщо фокус у вікні програми перебуває на кнопці, призводить до натискання цієї кнопки

source: <keycap>E</keycap> or <keycap>$</keycap>
de: <keycap>E</keycap> oder <keycap>$</keycap>
pt_br: <keycap>E</keycap> ou <keycap>$</keycap>
uk: <keycap>E</keycap> або <keycap>$</keycap>

source: Validation of input number considered as a value expressed in the reference currency (euro)
de: Auswertung der eingegebenen Zahl als Wert in der Referenzwährung Euro.
pt_br: Validação do número inserido como o um valor expresso na moeda de referência (euro)
uk: Визначення введеного числа як значення у основній валюті (євро)

source: Change sign of the result
de: Ändert das Vorzeichen des Ergebnisses
pt_br: Muda o sinal do resultado
uk: Зміна знаку результату

source: Any other key
de: Jede andere Taste
pt_br: Outra tecla qualquer
uk: Будь-яка інша клавіша

source: Validation of input number considered as a number in the other currency
de: Auswertung der eingegebenen Zahl als Wert in der anderen Währung.
pt_br: Validação do número inserido como um valor noutra moeda
uk: Визначення введеного числа як величини у неосновній валюті

source: The buttons
de: Die Knöpfe
pt_br: Os botões
uk: Кнопки

source: <guibutton>0</guibutton> to <guibutton>9</guibutton>
de: <guibutton>0</guibutton> bis <guibutton>9</guibutton>
pt_br: <guibutton>0</guibutton> a <guibutton>9</guibutton>
uk: Від <guibutton>0</guibutton> до <guibutton>9</guibutton>

source: <guibutton>.</guibutton> or <guibutton>,</guibutton>
de: <guibutton>.</guibutton> oder <guibutton>,</guibutton>
pt_br: <guibutton>.</guibutton> ou <guibutton>,</guibutton>
uk: <guibutton>.</guibutton> або <guibutton>,</guibutton>

source: Clear all: both input and result area
de: Löscht alles: Sowohl den Eingabe- wie auch den Ergebnisbereich
pt_br: Limpar tudo: tanto os parâmetros como a área de resultado
uk: Спорожнити все: область введення і область результату

source: <guibutton>€</guibutton> or <guibutton>$</guibutton>
de: <guibutton>€</guibutton> oder <guibutton>$</guibutton>
pt_br: <guibutton>€</guibutton> ou <guibutton>$</guibutton>
uk: <guibutton>€</guibutton> або <guibutton>$</guibutton>

source: The button labeled with the name of an other currency
de: Der Knopf mit der Beschriftung des anderen Währung
pt_br: O botão assinalado com o nome da outra moeda
uk: Кнопка з міткою, що відповідає назві неосновної валюти

source: Enter
de: Eingabetaste
uk: Ввести

source: <guibutton>Min</guibutton>, <guibutton>MR</guibutton>, <guibutton>M+</guibutton> and <guibutton>-</guibutton>
de: <guibutton>Min</guibutton>, <guibutton>MR</guibutton>, <guibutton>M+</guibutton> und <guibutton>-</guibutton>
pt_br: <guibutton>Min</guibutton>, <guibutton>MR</guibutton>, <guibutton>M+</guibutton> e <guibutton>M-</guibutton>
uk: <guibutton>Min</guibutton>, <guibutton>MR</guibutton>, <guibutton>M+</guibutton> і <guibutton>-</guibutton>

source: Store result in memory, recall memory into result, add result to memory and subtract result from memory
de: Speichert das Ergebnis im Zwischenspeicher, holt den Wert in das Ergebnisfeld zurück, addiert Ergebnisse zum Wert im Speicher und subtrahiert Ergebnisse vom Wert im Speicher.
pt_br: Guarda o resultado na memória, restaura o resultado com o valor em memória, adiciona o resultado à memória ou subtrai-o, respectivamente
uk: Зберегти результат у пам’яті, викликати результат з пам’яті, додати результат до значення у пам’яті і відняти результат від значення у пам’яті.

source: <guibutton>/</guibutton>, <guibutton>X</guibutton>, <guibutton>-</guibutton> and <guibutton>+</guibutton>
de: <guibutton>/</guibutton>, <guibutton>X</guibutton>, <guibutton>-</guibutton> und <guibutton>+</guibutton>
pt_br: <guibutton>/</guibutton>, <guibutton>X</guibutton>, <guibutton>-</guibutton> e <guibutton>+</guibutton>
uk: <guibutton>/</guibutton>, <guibutton>X</guibutton>, <guibutton>-</guibutton> і <guibutton>+</guibutton>

source: Reset
de: Zurücksetzen
uk: Скинути

source: Reset both input, result and memory
de: Setzt Eingaben, Ergebnis und Zwischenspeicher zurück
pt_br: Limpar o valor inserido, o resultado e a memória
uk: Скинути ввід, результат і пам’ять

source: About
de: Über
pt_br: Sobre
uk: Про

source: Help
de: Hilfe
pt_br: Ajuda
uk: Довідка

source: The drop down list with currency codes and names
de: Das Auswahlfeld mit den Kürzeln und Namen der Währung
pt_br: A lista com os códigos e os nomes das moedas
uk: Відкриває спадний список кодів і назв валют

source: Selects an other currency to work with
de: Wählt eine andere Währung, um damit zu arbeiten
pt_br: Seleciona outra moeda com a qual trabalhar
uk: Обирає іншу валюту для операцій

source: The Settings Dialog
de: Der Dialog Einstellungen
pt_br: A Janela de Configuração
uk: Діалогове вікно параметрів

source: Reference currency, rates origin
de: Referenzwährung, Ursprung des Umrechnungskurs
pt_br: Moeda de referência, origem das taxas
uk: Похідна валюта, джерело ставок

source: This setting defines from where &keurocalc; should download the exchange rates between the reference currency and other currencies. The following choices are available:
de: Diese Einstellung legt fest, wo &keurocalc; die Wechselkurse zwischen der Referenzwährung € und den anderen Währungen herunterladen soll: Folgendes steht zur Auswahl:
pt_br: Esta configuração define de onde o &keurocalc; deverá obter as taxas de câmbio entre a moeda de referência e as outras moedas. Estão disponíveis as seguintes opções:
uk: За допомогою цього пункту можна визначити джерело, звідки &keurocalc; має звантажувати обмінні курси між основною валютою і іншими валютами. Доступними є такі пункти:

source: Euro, no network access (fixed rates only)
de: Euro, kein Netzwerkzugriff (nur fester Kurs)
pt_br: Euro, sem acesso à rede (taxas fixas apenas)
uk: Євро, без доступу до мережі (лише фіксовані курси)

source: Euro is the reference currency. No variable rate is downloaded or used. The only available currencies are the ones that have a fixed conversion rate with the euro.
de: Der Euro ist die Referenzwährung. Es werden keine aktuellen variablen Währungskurse heruntergeladen oder verwendet. Es sind nur Währungen mit einem festen Wechselkurs zum Euro verfügbar.
pt_br: O Euro é a moeda de referência. Não é obtida nem usada nenhuma taxa variável. As únicas moedas disponíveis são as que têm uma taxa de câmbio fixa com o euro.
uk: Основною валютою є євро. Змінний курс не буде звантажено і використано. Доступними будуть лише записи валют, які мають фіксований обмінний курс відносно євро.

source: This setting is adapted to computers with no network access.
de: Diese Einstellung ist für Rechner ohne Netzwerkanschluß vorgesehen.
pt_br: Esta configuração está adaptada aos computadores sem rede.
uk: Цей параметр призначено для комп’ютерів без доступу до мережі.

source: Euro, European Central Bank
de: Euro, Europäische Zentralbank
pt_br: Euro, Banco Central Europeu
uk: Євро, Центральний Європейський Банк

source: Euro is the reference currency. The fixed exchange rates are available. &keurocalc; attempts to download the variable rates from the <ulink url="http://www.ecb.int/stats/eurofxref/">European Central Bank (ECB)</ulink>.
de: Der Euro ist die Referenzwährung. Die festen Währungskurse sind verfügbar. &keurocalc; versucht die aktuellen variablen Wechselkurse von der <ulink url="http://www.ecb.int/stats/eurofxref/">Europäischen Zentralbank (EZB)</ulink> herunterzuladen.
pt_br: O Euro é a moeda de referência. As taxas de câmbio fixas estão disponíveis. O &keurocalc; tenta obter as taxas variáveis do <ulink url="http://www.ecb.int/stats/eurofxref/">Banco Central Europeu(ECB)</ulink>.
uk: Основною валютою є євро. Доступними будуть фіксовані обмінні курси. &keurocalc; спробує звантажити змінні курси з сайта <ulink url="http://www.ecb.int/stats/eurofxref/">Європейського Центрального Банка (ECB)</ulink>.

source: Euro, Time Genie
uk: Євро, Time Genie

source: Euro is the reference currency. The fixed exchange rates are available. &keurocalc; attempts to download the variable rates from the <ulink url="http://rss.timegenie.com/foreign_exchange_rates_forex">Time Genie (TG)</ulink>.
de: Der Euro ist die Referenzwährung. Die festen Währungskurse sind verfügbar. &keurocalc; versucht die aktuellen variablen Wechselkurse von <ulink url="http://rss.timegenie.com/foreign_exchange_rates_forex">Time Genie (TG)</ulink> herunterzuladen.
pt_br: O Euro é a moeda de referência. As taxas de câmbio fixas estão disponíveis. O &keurocalc; tenta obter as taxas variáveis do <ulink url="http://rss.timegenie.com/foreign_exchange_rates_forex">Time Genie (TG)</ulink>.
uk: Основною валютою є євро. Доступними будуть фіксовані обмінні курси. &keurocalc; спробує звантажити змінні курси з сайта <ulink url="http://rss.timegenie.com/foreign_exchange_rates_forex">Time Genie (TG)</ulink>.

source: Default currency
de: Standardwährung
pt_br: Moeda padrão
uk: Типова валюта

source: This setting defines the other currency that is used when &keurocalc; starts up or when the user validates the new settings.
de: Diese Einstellung definiert die andere Währung, die in &keurocalc; beim Start des Programms eingestellt ist oder wenn der Benutzer neue Einstellungen auswertet.
pt_br: Esta configuração define a outra moeda que é usada quando o &keurocalc; se inicia ou o usuário valida a nova configuração.
uk: За допомогою цього пункту ви можете визначити неосновну валюту, яка використовуватиметься після запуску &keurocalc; або після підтвердження користувачем нових параметрів.

source: Notice that the selected currency might not be provided by the selected rates source. In that case, the first available currency in the list is used.
de: Beachten Sie, dass die ausgewählte Währung möglicherweise nicht in der gewählten Datenquelle vorhanden ist. In diesem Fall wird die erste verfügbare Währung in der Liste verwendet.
pt_br: Repare que a moeda selecionada poderá não ser fornecida pela fonte de taxas selecionada. Neste caso, a primeira moeda da lista é usada.
uk: Зауважте, що вибраної валюти може і не бути у списку валют вибраного джерела обмінних курсів. У випадку відсутності цієї валюти буде використано перший з доступних у списку пунктів валют.

source: Rounding
de: Runden
pt_br: Arredondamento
uk: Заокруглення

source: This setting defines how the results should be presented in the display area. Internally, all computations are done with the precision offered by the mathematical library, but it usually makes no sense presenting tenths of cents. The following rounding methods are available:
de: Diese Einstellung legt fest, wie die Ergebnisse im Anzeigebereich dargestellt werden. Intern werden alle Berechnungen mit der Genauigkeit der verwendeten mathematischen Bibliothek durchgeführt, aber es macht normalerweise keinen Sinn 1/10 Cent anzuzeigen. Folgende Rundungsverfahren stehen zur Auswahl:
pt_br: Esta configuração define como os resultados deverão ser apresentados na área correspondente. Internamente, todos os cálculos são feitos com a precisão que a biblioteca matemática oferece, mas algumas vezes poderá não fazer sentido apresentar décimos de cêntimos. Estão disponíveis os seguintes métodos de arredondamento:
uk: За допомогою цього пункту можна визначити спосіб показу результатів у відповідному полі. Внутрішні обчислення виконуватимуться програмою з точністю, яку може підтримувати математична бібліотека, але, зазвичай, немає сенсу підтримувати точність, вищу за десяті долі копійок. Можна використовувати такі методи округлення:
