Repository: netrunner-debian-kde-extras/keurocalc
Catalog: doc/*.po
Languages: de, pt_br, uk

source: If the fixed rates currencies are available, select the <guilabel>BEF - Belgian franc</guilabel> item in the currencies drop down list on the bottom. You can skip this step if it's already the selected currency.
de: Wenn die festen Währungskurse eingestellt sind, wählen Sie den Eintrag <guilabel>BEF - Belgische Franc</guilabel> im Auswahlfeld der Währungen. Ist diese Währung bereits ausgewählt, überspringen Sie diesen Schritt.
pt_br: Se as taxas de câmbio fixas estiverem disponíveis, selecione o <guilabel>BEF - Franco belga</guilabel> na lista de moedas abaixo. Você poderá evitar este passo se já estiver na moeda selecionada.
uk: Якщо доступні фіксовані курси, ви можете вибрати пункт <guilabel>BEF - Бельгійський франк</guilabel> зі спадного списку валют, розташованого у нижній частині вікна програми. Ви можете пропустити цей крок, якщо відповідну валюту вже було вибрано.

source: Type <userinput>25</userinput>.
de: Geben Sie <userinput>25</userinput> ein.
pt_br: Digite <userinput>25</userinput>.
uk: Введіть <userinput>25</userinput>.

source: Press the <guibutton>€</guibutton> button or the <keycap>E</keycap> key.
de: Drücken Sie den Knopf <guibutton>€</guibutton> oder die Taste <keycap>E</keycap>.
pt_br: Pressione o botão <guibutton>€</guibutton> ou a tecla <keycap>E</keycap>.
uk: Натисніть кнопку <guibutton>€</guibutton> або клавішу <keycap>E</keycap>.

source: Read the result in the <guilabel>Result</guilabel> display on the right: 1008.50 FB or 1008,50 FB. The exact value is 1008.4975, but it's rounded to the closest hundredth of a Belgian franc. The rounding unit depends on the currency and on the rounding method: with the official rounding rules, for Belgian francs it's 0.01 FB, for Italian liras it's 1 L for example.
de: Als <guilabel>Ergebnis</guilabel> wird rechts 1008.50 FB oder 1008,50 FB angezeigt. Der genaue Wert beträgt 1008,4975, wurde jedoch auf das nächste 1/100 eines belgischen Franc gerundet. Die Rundungseinheit wird durch die Währung und das Rundungsverfahren bestimmt: Mit den offiziellen Rundungsregeln beträgt die Rundungseinheit zum Beispiel 0,01 BF für belgische Franc und 1 Lira für die italienische Währung.
pt_br: Leia o resultado no campo <guilabel>Resultado</guilabel> à direita: 1008.50 FB ou 1008,50 FB. O valor exato é 1008,4975, mas ele é arredondado para o centésimo mais próximo de um Franco Belga. A unidade de arredondamento depende da moeda e do método de arredondamento: com as regras de arredondamento oficiais, para os Francos Belgas é 0,01 FB, enquanto que para as Liras Italianas é 1 L, por exemplo.
uk: Прочитайте результат у полі <guilabel>Результат</guilabel>, яке розташовано праворуч: 1008.50 FB або 1008,50 FB. Точним значенням є 1008,4975, але це значення буде округлено до сотих частин бельгійського франка. Одиниця округлення залежить залежить від валюти і способу округлення: за офіційними правилами округлення, наприклад, для бельгійських франків — це 0.01 FB, для італійських лір — це 1 L.

source: You could also have typed: <userinput>25 Enter E</userinput>.
de: Sie können auch folgendes eingeben: <userinput>25 Eingabetaste E</userinput>.
pt_br: Você poderia também ter escrito: <userinput>25 Enter E</userinput>.
uk: Ви також могли послідовно натиснути: <userinput>25 Enter E</userinput>.

source: To convert 120 German marks into Spanish pesetas
de: Umrechnung von 120 Deutsche Mark in Spanische Peseten.
pt_br: Para converter 120 Marcos Alemães em Pesetas Espanholas
uk: Щоб дізнатися вартість 120 німецьких марок у іспанських песетах

source: If the fixed rates currencies are available, select the <guilabel>DEM - German deutschmark</guilabel> item in the currencies drop down list.
de: Wenn die festen Währungskurse eingestellt sind, wählen Sie den Eintrag <guilabel>DM - Deutsche Mark</guilabel> im Auswahlfeld der Währungen.
pt_br: Se as taxas de câmbio fixas estiverem disponíveis, selecione o item <guilabel>DEM - Marco alemão</guilabel> na lista de moedas.
uk: Якщо доступні фіксовані курси валют, оберіть пункт <guilabel>DEM - Німецька дойчмарка</guilabel> у спадному списку валют.

source: Type <userinput>120</userinput>.
de: Geben Sie <userinput>120</userinput> ein.
pt_br: Digite <userinput>120</userinput>.
uk: Введіть <userinput>120</userinput>.

source: Press the <guibutton>DM</guibutton> button or the <keycap>D</keycap> or <keycap>M</keycap> keys.
de: Drücken Sie den Knopf <guibutton>DM</guibutton> oder die Tasten <keycap>D</keycap> oder <keycap>M</keycap>.
pt_br: Pressione o botão <guibutton>DM</guibutton> ou as teclas <keycap>D</keycap> ou <keycap>M</keycap>.
uk: Натисніть кнопку <guibutton>DM</guibutton> або одну з клавіш <keycap>D</keycap> або<keycap>M</keycap>.

source: Just select the <guilabel>ESP - Spanish peseta</guilabel> item to see the same amount of 61.36 € converted into pesetas in the <guilabel>Result</guilabel> area.
de: Nun wählen Sie den Eintrag <guilabel>ESP - Spanische Peseten</guilabel>, dann wird der gleiche Betrag von 61,36 € umgewandelt in Peseten im Feld <guilabel>Ergebnis</guilabel> angezeigt.
pt_br: Agora selecione o item <guilabel>ESP - Peseta espanhola</guilabel> para ver a mesma quantia de 61,36 € convertida para pesetas na área do <guilabel>Resultado</guilabel>.
uk: Оберіть пункт <guilabel>ESP - Іспанська песета</guilabel>, щоб переглянути те саме значення у 61,36 € у песетах: його буде показано у полі <guilabel>Результат</guilabel>.

source: Adding and Subtracting
de: Addieren und Subtrahieren
pt_br: Somar e Subtrair
uk: Додавання і віднімання

source: How much is 3 + 5?
de: Wieviel ist 3 + 5?
pt_br: Quanto é 3 + 5?
uk: Скільки буде 3 + 5?

source: Type <userinput>3</userinput> and then press <guibutton>+</guibutton>. Notice that in the result field, <computeroutput>3</computeroutput> is a simple value displayed on just one line, with no monetary unit.
de: Geben Sie <userinput>3</userinput> ein und drücken Sie dann <guibutton>+</guibutton>. Im Ergebnisfeld wird dann <computeroutput>3</computeroutput> als einfacher Wert in einer Zeile ohne Währungseinheit angezeigt.
pt_br: Digite <userinput>3</userinput> e depois pressione em <guibutton>+</guibutton>. Repare que, no campo de resultado, o <computeroutput>3</computeroutput> é um valor simples mostrado apenas numa linha, sem unidades monetárias.
uk: Введіть <userinput>3</userinput>, а потім натисніть <guibutton>+</guibutton>. Зауважте, що у полі <computeroutput>3</computeroutput> буде показано просте значення у одному рядку, без шифру грошової одиниці.

source: Type <userinput>5</userinput> and then press the <guibutton>Enter</guibutton> button or the &Enter; key. The result <computeroutput>8</computeroutput> appears on the right.
de: Geben Sie <userinput>5</userinput> ein und drücken dann den Knopf <guibutton>Eingabe</guibutton> oder die Taste &Enter;. Als Ergebnis wird rechts <computeroutput>8</computeroutput> angezeigt.
pt_br: Digite <userinput>5</userinput> e depois pressione o botão <guibutton>Introduzir</guibutton> ou a tecla &Enter;. O resultado <computeroutput>8</computeroutput> aparecerá à direita.
uk: Введіть <userinput>5</userinput>, а потім натисніть кнопку <guibutton>Ввести</guibutton> або клавішу &Enter;. Результат (<computeroutput>8</computeroutput>) з’явиться у полі, розташованому праворуч.

source: You received 100 US dollars and paid 32.50 euros for a book, how much do you have left in your bank account?
de: Sie haben 100 US-Dollar erhalten und 32,50 € für ein Buch ausgegeben, wieviel bleibt noch auf Ihrem Bankkonto?
pt_br: Você recebeu 100 dólares dos EUA e pagou 32,50 euros por um livro; quanto você tem na sua conta do banco?
uk: Ви отримали 100 доларів США і заплатили 32,50 євро за книжку, скільки залишилося на вашому банківському рахунку?

source: Make sure that the variable exchange rates are available. If not, press the <guibutton>Settings...</guibutton> to select either <guilabel>Euro, European Central Bank</guilabel> or <guilabel>Euro, Time Genie</guilabel>. Now select the <guilabel>USD - US dollar</guilabel> item in the scroll down list on the bottom. If you have no Internet access, that item won't be available as the latest variable rates between the euro and the dollar cannot be determined.
de: Überprüfen Sie, ob die aktuellen variablen Wechselkurse verfügbar sind. Falls nicht, drücken Sie <guibutton>Einstellungen ...</guibutton> und stellen <guilabel>Euro, Europäische Zentralbank</guilabel> oder <guilabel>Euro, Time Genie</guilabel> ein. Wählen Sie nun <guilabel>USD - US-Dollar</guilabel> im Auswahlfeld Währung. Ohne Internetverbindung ist dieser Eintrag nicht vorhanden, da der neueste variable Wechselkurs zwischen Euro und Dollar nicht bestimmt werden kann.
pt_br: Certifique-se de que as taxas de câmbio variáveis estão disponíveis. Caso contrário, pressione o botão <guibutton>Configurações...</guibutton> para selecionar tanto o <guilabel>Euro, Banco Central Europeu</guilabel> ou <guilabel>Euro, Time Genie</guilabel>. Agora, selecione o <guilabel>USD - dólar americano</guilabel> na lista abaixo. Se não tiver nenhum acesso à Internet, esse item não estará disponível, uma vez que as últimas taxas variáveis entre o euro e o dólar não poderão ser determinadas.
uk: Переконайтеся, що ви маєте доступ до змінних обмінних курсів. Якщо це не так, натисніть кнопку <guibutton>Параметри...</guibutton>, щоб вибрати або пункт <guilabel>Євро, Центральний Європейський Банк</guilabel> або <guilabel>Євро, TG</guilabel>. Після цього оберіть пункт <guilabel>USD - Долар США</guilabel> зі спадного списку, розташованого у нижній частині вікна програми. Якщо у вас немає доступу до мережі Інтернет, цей пункт не буде доступним, оскільки програма не зможе визначити останні змінні курси між євро і доларом.

source: Type <userinput>100</userinput> and then press <guibutton>$</guibutton>.
de: Geben Sie <userinput>100</userinput> ein und drücken Sie dann den Knopf <guibutton>$</guibutton>.
pt_br: Digite <userinput>100</userinput> e depois pressione <guibutton>$</guibutton>.
uk: Введіть <userinput>100</userinput> і натисніть кнопку <guibutton>$</guibutton>.

source: Press the <guibutton>-</guibutton> button or the <keycap>-</keycap> key. Notice the <computeroutput>-</computeroutput> sign in the leftmost part of the <guilabel>Input</guilabel> display.
de: Drücken Sie den Knopf <guibutton>-</guibutton> oder die Taste <keycap>-</keycap>. Beachten Sie das Zeichen <computeroutput>-</computeroutput> links vom Feld <guilabel>Eingabe</guilabel>.
pt_br: Pressione o botão <guibutton>-</guibutton> ou a tecla <keycap>-</keycap>. Repare no sinal <computeroutput>-</computeroutput> do lado esquerdo do campo <guilabel>Entrada</guilabel>.
uk: Натисніть кнопку <guibutton>-</guibutton> або клавішу <keycap>-</keycap>. Зауважте, що у найлівішій частині поля <guilabel>Ввід</guilabel> буде показано знак <computeroutput>-</computeroutput>.

source: Type <userinput>32,50</userinput> or <userinput>32.50</userinput> and then press <guibutton>€</guibutton>.
de: Geben Sie <userinput>32,50</userinput> oder <userinput>32.50</userinput> ein und drücken Sie dann den Knopf <guibutton>€</guibutton>.
pt_br: Digite <userinput>32,50</userinput> ou <userinput>32.50</userinput> (dependendo da configuração regional) e depois pressione <guibutton>€</guibutton>.
uk: Введіть <userinput>32,50</userinput> або <userinput>32.50</userinput>, а потім натисніть кнопку <guibutton>€</guibutton>.

source: Read the result in the <guilabel>Result</guilabel> display on the right. The exact value might depend on latest exchange rates. Notice that during the whole computation you've been able to read the values both in euro and in US dollars. Pay attention to the fact that different data sources (ECB or TG) might not provide the same conversion rate between the euro and the dollar.
de: Die Auswertung der Berechnung sehen Sie rechts im Feld <guilabel>Ergebnis</guilabel>. Der genaue Wert wird durch die aktuellen Wechselkurse bestimmt. Bei der gesamten Berechnung können Sie beide Werte sowohl in Euro als auch in US-Dollar sehen. Beachten Sie, das verschiedene Datenquellen (EZB oder TG) manchmal auch verschiedene Umrechnungskurse zwischen Euro und Dollar angeben.
pt_br: Leia o resultado no campo <guilabel>Resultado</guilabel> à direita. O valor exato poderá depender das últimas taxas de câmbio. Repare que, durante o cálculo completo, você foi capaz de ler os valores tanto em Euros como em Dólares. Preste atenção ao fato de que as diferentes fontes de dados (ECB ou TG) poderão não fornecer a mesma taxa de câmbio entre o Euro e o Dólar Americano.
uk: Прочитайте результат у полі <guilabel>Результат</guilabel>, розташованому праворуч. Точне значення може залежати від останніх обмінних курсів. Зауважте, що протягом обчислень ви могли спостерігати за значеннями у євро і доларах США. Зверніть увагу на те, що за використання різних джерел даних (ECB і TG) обмінні курси між євро і доларом можуть не збігатися.

source: You pay a 32.50 € book with a 500 FF banknote. How much was the clerk supposed to give you back, in euro notes and coins?
de: Sie zahlen 32,50 € für ein Buch mit einer Banknote von 500 französischen Francs. Wieviel erhalten Sie als Noten und Münzen in Euro zurück?
pt_br: Você paga um livro de 32,50 € com uma nota de 500 FF. Quanto o atendente deveria lhe dar de troco, em moedas e notas de Euro?
uk: Ви заплатили за книгу, що коштує 32,50 € банкнотою у 500 FF. Скільки має повернути вам касир у банкнотах і монетах євро?

source: Select the <guilabel>FRF - French francs</guilabel> item in the currencies drop down list if not already selected.
de: Wählen Sie den Eintrag <guilabel>FRF - Französische Francs</guilabel> im Auswahlfeld für Währungen, falls nicht bereits eingestellt.
pt_br: Selecione o item <guilabel>FRF - Francos franceses</guilabel> na lista de moedas, se não estiver já selecionado.
uk: Оберіть пункт <guilabel>FRF - Французькі франки</guilabel> у спадному списку валют, якщо цей пункт ще не вибрано.

source: Type <userinput>32.50</userinput> or <userinput>32,50</userinput> and then press <guibutton>€</guibutton>. You can also type <userinput>32.5</userinput> without the trailing <userinput>0</userinput>.
de: Geben Sie <userinput>32,50</userinput> oder <userinput>32.50</userinput> ein und drücken Sie dann den Knopf <guibutton>€</guibutton>. Sie können auch <userinput>32,5</userinput> ohne die angehängte <userinput>0</userinput> eingeben.
pt_br: Digite <userinput>32.50</userinput> ou <userinput>32,50</userinput> e depois pressione <guibutton>€</guibutton>. Você poderá também digitar <userinput>32,5</userinput> sem o <userinput>0</userinput> final.
uk: Введіть <userinput>32.50</userinput> або <userinput>32,50</userinput>, а потім натисніть кнопку <guibutton>€</guibutton>. Ви також можете ввести <userinput>32.5</userinput> без останнього <userinput>0</userinput>.

source: Press the <guibutton>-</guibutton> button or the <keycap>-</keycap> key.
de: Drücken Sie den Knopf <guibutton>-</guibutton> oder die Taste <keycap>-</keycap>.
pt_br: Pressione o botão <guibutton>-</guibutton> ou a tecla <keycap>-</keycap>.
uk: Натисніть кнопку <guibutton>-</guibutton> або клавішу <keycap>-</keycap>.

source: Type <userinput>500</userinput> and press the <guibutton>FF</guibutton> button or the <keycap>F</keycap> key.
de: Geben Sie <userinput>500</userinput> ein und drücken Sie den Knopf <guibutton>FF</guibutton> oder die Taste <keycap>F</keycap>.
pt_br: Digite <userinput>500</userinput> e pressione o botão <guibutton>FF</guibutton> ou a tecla <keycap>F</keycap>.
uk: Введіть <userinput>500</userinput> і натисніть кнопку <guibutton>FF</guibutton> або клавішу <keycap>F</keycap>.

source: The result <computeroutput>-43.72 €</computeroutput> is negative, indicating that change money has to be given back to the customer. The <guibutton>+/-</guibutton> button or the <keycap>S</keycap> key permit you to change the sign of the result.
de: Das Ergebnis <computeroutput>-43,72 €</computeroutput> ist negativ und zeigt an, dass dem Kunden Wechselgeld zurückgegeben werden muss. Mit dem Knopf <guibutton>+/-</guibutton> oder der Taste <keycap>S</keycap> kann das Vorzeichen eines Ergebnisses geändert werden.
pt_br: O resultado <computeroutput>-43,72 €</computeroutput> é negativo, o que significa que é necessário dar troco de volta ao cliente. O botão <guibutton>+/-</guibutton> ou a tecla <keycap>S</keycap> permite-lhe mudar o sinal do resultado.
uk: Результат <computeroutput>-43,72 €</computeroutput> є від’ємним, що позначає, що покупцеві слід повернути саме цю суму. За допомогою натискання кнопки <guibutton>+/-</guibutton> або клавіші <keycap>S</keycap> ви можете змінити знак результату.

source: Do not try to add euros to simple values (with no currency unit): it won't work, for the same reason you cannot add 5 meters to 3 kilograms.
de: Versuchen Sie nicht Euros zu einfachen Werten ohne Währungseinheit zu addieren. Das funktioniert nicht, genauso wenig wie die Addition von 5 Metern und 3 Kilogramm.
pt_br: Não tente adicionar euros a valores simples (sem unidades monetárias): não irá funcionar, pela mesma razão que você não consegue adicionar 5 metros a 3 quilogramas.
uk: Не намагайтеся додати євро з простими значеннями (які не є грошовими величинами): таке додавання неможливе, з тої самої причини, з якої ви не можете додати 5 метрів і 3 кілограми.

source: Multiplying and Dividing
de: Multiplizieren und Dividieren
pt_br: Multiplicar e Dividir
uk: Множення і ділення

source: You buy 3.2 kilograms of apples at 2 € per kilogram. How much does the whole cost in Australian dollars?
de: Sie kaufen 3,2 Kilogramm Äpfel zum Preis von 2 € je Kilogramm. Wieviel kostet das in australischen Dollar?
pt_br: Você compra 3,2 quilogramas de maçãs a 2 € o quilograma. Quanto isso custa em dólares Australianos?
uk: Ви придбали 3,2 кілограми яблук за ціною 2 € за кілограм. Скільки все це коштуватиме у австралійських доларах?

source: Select the <guilabel>AUD - Australian dollar</guilabel> item if available and if not already selected.
de: Wählen Sie den Eintrag <guilabel>AUD - Australische Dollar</guilabel> im Auswahlfeld für Währungen, falls nicht bereits eingestellt.
pt_br: Selecione o item <guilabel>AUD - Dólar australiano</guilabel> se estiver disponível e não estiver já selecionado.
uk: Оберіть пункт <guilabel>AUD - Австралійський долар</guilabel>, якщо він доступний і якщо його ще не вибрано.

source: Type <userinput>2</userinput> and press <guibutton>€</guibutton>.
de: Geben Sie <userinput>2</userinput> ein und drücken Sie dann den Knopf <guibutton>€</guibutton>.
pt_br: Digite <userinput>2</userinput> e pressione <guibutton>€</guibutton>.
uk: Введіть <userinput>2</userinput> і натисніть кнопку <guibutton>€</guibutton>.

source: Press the <guibutton>X</guibutton> button or the <keycap>*</keycap> key. Notice the <computeroutput>X</computeroutput> sign at the left of the <guilabel>Input</guilabel> display.
de: Drücken Sie den Knopf <guibutton>X</guibutton> oder die Taste <keycap>*</keycap>. Beachten Sie das Zeichen <computeroutput>X</computeroutput> links vom Feld <guilabel>Eingabe</guilabel>.
pt_br: Pressione o botão <guibutton>X</guibutton> ou a tecla <keycap>*</keycap>. Repare no sinal <computeroutput>X</computeroutput> à esquerda do campo <guilabel>Entrada</guilabel>.
uk: Натисніть кнопку <guibutton>X</guibutton> або клавішу <keycap>*</keycap>. Ліворуч у полі <guilabel>Ввід</guilabel> ви можете помітити знак <computeroutput>X</computeroutput>.

source: Now type <userinput>3.2</userinput> followed by the <guibutton>Enter</guibutton> button or the &Enter; key: this means <quote>3.2 units</quote> at 2 € each.
de: Geben Sie nun <userinput>3,2</userinput> ein und drücken dann den Knopf <guibutton>Eingabe</guibutton> oder die Taste &Enter;: Die bedeutet <quote>3,2 Einheiten</quote> zu je 2 €.
pt_br: Agora, digite <userinput>3,2</userinput> seguido do botão <guibutton>Introduzir</guibutton> ou da tecla &Enter;: isto significa <quote>3,2 unidades</quote> a 2 € cada.
uk: Введіть <userinput>3.2</userinput>, натисніть кнопку <guibutton>Ввести</guibutton> або клавішу &Enter;: це означає <quote>3.2 одиниць</quote> по 2 € кожна.

source: The result in Australian dollars matches <computeroutput>6.4 €</computeroutput>.
de: Das Ergebnis in australischen Dollar entspricht <computeroutput>6,4 €</computeroutput>.
pt_br: O resultado em dólares Australianos corresponde a <computeroutput>6,4 €</computeroutput>.
uk: Результат у австралійських доларах відповідає <computeroutput>6.4 €</computeroutput>.

source: You could also have used the following order: <userinput>3.2 = * 2 €</userinput> or even <userinput>3.2 * 2 €</userinput>.
de: Sie können auch die folgende Reihenfolge benutzen: <userinput>3.2 = * 2 €</userinput> oder sogar <userinput>3.2 * 2 €</userinput>.
pt_br: Você poderia também ter usado a seguinte ordem: <userinput>3,2 = * 2 €</userinput> ou ainda <userinput>3,2 * 2 €</userinput>.
uk: Ви могли також скористатися таким порядком натискання кнопок: <userinput>3.2 = * 2 €</userinput>, або навіть таким: <userinput>3.2 * 2 €</userinput>.

source: It's not possible to multiply X euros by Y dollars, just as you don't multiply 10 fingers by 2 ears.
de: Sie könne keine x € mit y Dollar multiplizieren, genauso wenig wie 10 Finger mit 2 Ohren.
pt_br: Claro que não é possível multiplicar X euros por Y dólares, assim como você não multiplica 10 dedos por 2 orelhas.
uk: Ви не можете перемножити X євро на Y доларів, так само, як ви не можете перемножити 10 пальців на 2 вуха.

source: Using Percentages
de: Arbeiten mit Prozenten
pt_br: Usar as Percentagens
uk: Використання відсотків

source: How much is 20% of 3000 yen?
de: Wieviel ist 20 % von 3000 Yen?
pt_br: Quanto é 20% de 3000 ienes?
uk: Скільки буде 20% від 3000 єн?

source: Select the <guilabel>JPY - Japanese yen</guilabel> item if available and if not already selected.
de: Wählen Sie den Eintrag <guilabel>JPY - Japanische Yen</guilabel> im Auswahlfeld für Währungen, falls nicht bereits eingestellt.
pt_br: Selecione o <guilabel>JPY - Iene japonês</guilabel> se estiver disponível e não estiver já selecionado.
uk: Оберіть пункт <guilabel>JPY - Японська єна</guilabel>, якщо він доступний і його ще не вибрано.

source: Type <userinput>3000</userinput> and press the <guibutton>¥</guibutton> button or the <keycap>Y</keycap> key.
de: Geben Sie <userinput>3000</userinput> ein und drücken Sie den Knopf <guibutton>¥</guibutton> oder die Taste <keycap>Y</keycap>.
pt_br: Digite <userinput>3000</userinput> e pressione o botão <guibutton>¥</guibutton> ou a tecla <keycap>Y</keycap>.
uk: Введіть <userinput>3000</userinput> і натисніть кнопку <guibutton>¥</guibutton> або клавішу <keycap>Y</keycap>.

source: Enter <userinput>20</userinput> and press the <guibutton>%</guibutton> button or the <keycap>%</keycap> key. As with multiplications, the value had to be typed <emphasis>before</emphasis> the percentage.
de: Geben Sie <userinput>20</userinput> ein und drücken Sie den Knopf <guibutton>%</guibutton> oder die Taste <keycap>%</keycap>. Wie bei der Multiplikation muss der Wert <emphasis>vor</emphasis> dem Prozentzeichen eingegeben werden.
pt_br: Digite <userinput>20</userinput> e pressione o botão <guibutton>%</guibutton> ou a tecla <keycap>%</keycap>. Assim como com as multiplicações, o valor teve ser escrito <emphasis>antes</emphasis> da percentagem.
uk: Введіть <userinput>20</userinput> і натисніть кнопку <guibutton>%</guibutton> або клавішу <keycap>%</keycap>. Як і у випадку множення, значення слід ввести <emphasis>до</emphasis> символу відсотків.

source: Look at the result: it is equivalent to 600 yen.
de: Als Ergebnis wird 600 Yen angezeigt.
pt_br: Olhe para o resultado: é equivalente a 600 ienes.
uk: Погляньте на результат: вийшло 600 єн.

source: How much is 3000 yen plus 20%?
de: Wieviel ist 3000 Yen plus 20%?
pt_br: Quanto são 3 000 ienes mais 20%?
uk: Скільки буде 3000 єн плюс 20%?
