Repository: netrunner-debian-kde-extras/keurocalc
Catalog: doc/*.po
Languages: de, pt_br, uk

source: The &keurocalc; Handbook
de: Das Handbuch zu &keurocalc;
pt_br: Manual do &keurocalc;
uk: Підручник з &keurocalc;

source: ROLES_OF_TRANSLATORS
de: <othercredit role="translator"><firstname>Burkhard</firstname><surname>Lück</surname><affiliation><address><email>lueck@hube-lueck.de</email></address></affiliation><contrib>Übersetzung</contrib></othercredit>
pt_br: <othercredit role="translator"><firstname>Marcus</firstname><surname>Gama</surname><affiliation><address><email>marcus.gama@gmail.com</email></address></affiliation><contrib>Tradução</contrib></othercredit>
uk: <othercredit role="translator"><firstname>Юрій</firstname><surname>Чорноіван</surname><affiliation><address><email>yurchor@ukr.net</email></address></affiliation><contrib>Переклад українською</contrib></othercredit>

source: &keurocalc; is an universal pocket currency converter and calculator. This documentation describes &keurocalc; version 1.2.0.
de: &keurocalc; ist ein universeller Währungsumwandler und -rechner. Dies Handbuch beschreibt &keurocalc; Version 1.2.0.
pt_br: O &keurocalc; é um conversor e calculadora de cotações monetárias de bolso. Esta documentação descreve o &keurocalc; versão 1.2.0.
uk: &keurocalc; — це універсальний кишеньковий інструмент для обчислення вартості грошових сум у різних валютах і калькулятор. У цій документації описано &keurocalc; версії 1.2.0.

source: currency
de: Währung
pt_br: moeda
uk: валюта

source: converter
de: Umrechnung
pt_br: conversor
uk: перетворювач

source: calculator
de: Rechner
pt_br: calculadora
uk: калькулятор

source: Introduction
de: Einleitung
pt_br: Introdução
uk: Вступ

source: &keurocalc; is an universal pocket currency converter and calculator.
de: &keurocalc; ist ein universeller Währungsumwandler und -rechner.
pt_br: O &keurocalc; é um conversor e uma calculadora de cotações e moedas de bolso.
uk: &keurocalc; — це універсальний кишеньковий інструмент для обчислення вартості грошових сум у різних валютах і калькулятор.

source: On the 1st of January, 2002, 12 European countries united their national currencies into a single one, the euro (€). The same happens from time to time on a smaller scale with new European countries. &keurocalc; helps:
de: Am 1. Januar 2002 haben 12 europäische Länder Ihre nationalen Währungen durch eine gemeinsame Währung, den Euro (€), ersetzt. Das gleiche passiert von Zeit zu Zeit, wenn weitere europäische Länder der Währungsunion beitreten. &keurocalc; unterstützt Sie dann:
pt_br: A 1 de Janeiro de 2002, 12 países europeus uniram as suas moedas nacionais numa só, o euro (€). O mesmo acontece de tempos a tempos, em uma escala menor, à medida que entram novos países Europeus. O &keurocalc; ajuda:
uk: Першого січня 2002року 12 європейських країн об’єднали свої національні валюти до однієї спільної, євро (€). Подібний перехід відбувається час від часу і у інших європейських країнах. &keurocalc; допоможе вам:

source: During the transition periods
de: Während der Übergangszeit
pt_br: Durante os períodos de transição
uk: Протягом періоду переходу на іншу валюту

source: To verify one's bank account, when paying both in euros and in the old currency (Italian liras, for example).
de: Bei der Überprüfung eines Bankkontos, wenn sowohl in Euro sowie auch in der alten Währung wie zum Beispiel der italienischen Lira gezahlt wird.
pt_br: Para verificar a conta do banco de uma pessoa, ao pagar tanto em euros como na moeda antiga (liras Italianas, por exemplo).
uk: Під час перевірки банківського рахунку, якщо ви сплачуєте одразу у євро та старій валюті (наприклад італійських лірах).

source: To verify one's shopping, and compute the change if paying with a banknote labeled in the old currency.
de: Zur Überprüfung von Einkäufen und Ermittlung des Wechselgelds, wenn Sie mit Noten in alten Währungen bezahlen.
pt_br: Para verificar as compras de uma pessoa e calcular o troco se for pagar com uma nota de banco ainda na moeda antiga.
uk: Під час перевірки вартості закупів і обчислення решти, якщо ви сплачуєте у старій валюті.

source: Many years after the transition periods
de: Viele Jahre nach der Übergangszeit
pt_br: Muitos anos depois do período de transição
uk: Ще протягом багатьох років після періоду переходу

source: To get an idea of the value of the things in the old currency at any stage of calculations.
de: Um eine Vorstellung vom Wert vieler Dinge in der alten Währung zu jedem beliebigen Zeitpunkt von Berechnungen zu bekommen.
pt_br: Para ter uma ideia do valor das coisas na moeda antiga em qualquer fase dos cálculos.
uk: Для розуміння того, скільки та чи інша річ коштувала у старій валюті на будь-якому з етапів розрахунку.

source: At any time
de: Zu jeder Zeit
pt_br: A qualquer momento
uk: Будь-коли

source: To do conversions between the euro and other currencies, like the British Pound, according to the daily exchange rate published by the <ulink url="http://www.ecb.int/stats/eurofxref/">European Central Bank (ECB)</ulink>.
de: Bei der Umwandlung zwischen dem Euro und anderen Währungen wie zum Beispiel dem Britischen Pfund nach den aktuellen Umrechnungskursen der <ulink url="http://www.ecb.int/stats/eurofxref/">Europäischen Zentralbank (EZB)</ulink>.
pt_br: Para fazer conversões entre o Euro e outras moedas, como a Libra Inglesa, de acordo com a taxa de câmbio diária publicada pelo <ulink url="http://www.ecb.int/stats/eurofxref/">Banco Central Europeu (ECB)</ulink>.
uk: Для виконання перетворень суми у євро на суму у інших валютах, наприклад британських фунтах, відповідно до курсу обміну, оприлюдненого <ulink url="http://www.ecb.int/stats/eurofxref/">Європейським центральним банком (ЄЦБ)</ulink>.

source: To do conversions between any two currencies that are part of the list published by the ECB.
de: Bei Umrechnungen zwischen zwei beliebigen Währungen, die in der von der EZB herausgegebenen Liste enthalten sind.
pt_br: Para fazer conversões entre quaisquer duas moedas que façam parte da lista publicada pelo ECB.
uk: Для виконання перетворення сум у будь-яких інших валютах, які містяться у списку, оприлюдненому ЄЦБ.

source: To do conversions between the euro and other currencies, like the British Pound, according to the daily exchange rate published by the <ulink url="http://rss.timegenie.com/foreign_exchange_rates_forex">Time Genie</ulink> foreign exchange (TG).
de: Bei Umrechnungen zwischen dem Euro und anderen Währungen wie zum Beispiel dem Britischen Pfund nach den aktuellen Umrechnungskursen der <ulink url="http://rss.timegenie.com/foreign_exchange_rates_forex">Time Genie (TG)</ulink>.
pt_br: Para fazer conversões entre o Euro e outras moedas, como a Libra Inglesa, de acordo com a taxa de câmbio diária publicada pelo <ulink url="http://rss.timegenie.com/foreign_exchange_rates_forex">Time Genie (TG)</ulink>.
uk: Для виконання перетворень суми у євро на суму у інших валютах, наприклад британських фунтах, відповідно до курсу обміну, оприлюдненому службою обміну валют <ulink url="http://rss.timegenie.com/foreign_exchange_rates_forex">Time Genie</ulink> (TG).

source: To do conversions between any two currencies that are part of the list published by the TG.
de: Für Umrechnungen zwischen zwei beliebigen Währungen, die in der von TG herausgegebenen Liste enthalten sind.
pt_br: Para fazer conversões entre quaisquer duas moedas que façam parte da lista publicada pelo TG.
uk: Для виконання перетворення сум у будь-яких інших валютах, які містяться у списку, оприлюдненому TG.

source: &keurocalc; has the following advantages in term of comfort and usability:
de: &keurocalc; hat folgende Vorteile in Hinsicht auf Komfort und Bedienungsfreundlichkeit:
pt_br: O &keurocalc; tem as seguintes vantagens em termos de conforto e usabilidade:
uk: &keurocalc; має такі переваги з точки зору комфорту і зручності у користуванні:

source: You see every intermediate value and the result in both the reference currency (euro) and in the other currency.
de: Jeder Zwischenwert und das Ergebnis wird sowohl in der Referenzwährung (€) wie auch in der anderen Währung angezeigt.
pt_br: Você vê todos os valores intermediários e o resultado tanto na moeda de referência (euro) e na outra moeda.
uk: Ви можете бачити всі проміжні значення і результат у основній валюті (євро), а також у вказаній вами валюті.

source: There is a separate input area where you can type a new value while still having the previous result visible.
de: Es gibt ein eigenes Eingabefeld, um neue Werte einzutragen, dabei wird das vorherige Ergebnis immer noch angezeigt.
pt_br: Existe uma área de dados onde você pode digitar um valor novo, mantendo ainda o resultado anterior visível.
uk: У програмі передбачено окрему ділянку для вводу, куди ви можете ввести нове значення без втрати можливості спостерігати за попереднім результатом.

source: The ergonomy is very close to usual pocket calculators, despite the fact that any value you type can be a value in the reference currency (euro), a value in the other currency, a percentage or an unit-less quantity.
de: Die Bedienung ist an die üblichen Taschenrechner angelehnt, mit der Ausnahme, dass jeder eingegebene Wert als Wert in der Referenzwährung Euro, in der anderen Währung, als Prozentwert und als einheitenloser Wert verarbeitet werden kann.
pt_br: A ergonomia é muito parecida com a das calculadoras de bolso, apesar do fato de qualquer valor que você digite possa ser um valor na moeda de referência (euro), um valor na outra moeda, uma percentagem ou uma quantia sem unidades.
uk: Ергономіка програми дуже близька до ергономіки звичайних кишенькових калькуляторів, не зважаючи на те, що ви можете ввести будь-яке значення у основній валюті (євро), у іншій валюті, у відсотках або у вигляді безрозмірної величини.

source: You press the keys in the order you would speak aloud what you're doing.
de: Sie drücken die Tasten in der Reihenfolge, in der Sie beschreiben, was Sie tun.
pt_br: Você pressiona as teclas na ordem que usaria se dissesse alto o que estava fazendo.
uk: Ви маєте натискати клавіші у тому порядку, у якому ви б вимовляли відповідні діям слова.

source: If you make mistakes, a special correction button enables you to correct your last input data, as long as you didn't validate.
de: Bei Fehlern kann das zuletzt eingegebene Datum mit einer speziellen Taste korrigiert werden, solange die Eingabe noch nicht ausgewertet wurde.
pt_br: Se você cometer algum erro, um botão de correção especial permite-lhe corrigir os seus últimos dados inseridos, desde que não os tenha validado.
uk: Якщо ви зробите помилку, за допомогою особливої кнопки виправлення ви можете виправити останні введені дані, аж доки ви їх не підтвердите.

source: The numbers are displayed according to your locale settings: with either a comma or a dot as a decimal point, according to your &systemsettings; settings.
de: Die Zahlen werden entsprechend den Regionaleinstellungen entweder mit einem Komma oder einem Punkt als Dezimaltrennzeichen angezeigt, wie in den &systemsettings; festgelegt.
pt_br: Os números são apresentados de acordo com a sua configuração local: quer com uma vírgula quer com um ponto como separador decimal, de acordo com a sua configuração do &systemsettings;.
uk: Числа буде показано у відповідності з параметрами локалі вашої системи: буде використано десяткову кому або десяткову крапку, залежно від параметрів, вказаних у «Системних параметрах».

source: You can decide where &keurocalc; should download the conversion rates from, which currency to start with when you launch &keurocalc;, and which rounding method to use.
de: Es kann eingestellt werden, woher &keurocalc; die Wechselkurse herunterlädt, welche Währung beim Start von &keurocalc; gesetzt ist und welches Rundungsverfahren verwendet wird.
pt_br: Você pode decidir onde o &keurocalc; deve baixar as taxas de conversão, qual a moeda deve ser usada ao iniciar o &keurocalc; e qual o método de arredondamento usar.
uk: Ви можете вибрати, звідки &keurocalc; має звантажувати дані обмінних курсів, початкову валюту, яка використовуватиметься після запуску &keurocalc;, а також визначитися з методом округлення значень.

source: &keurocalc; allows the following operations:
de: &keurocalc; ermöglicht die folgenden Operationen:
pt_br: O &keurocalc; permite as seguintes operações:
uk: За допомогою &keurocalc; можна виконувати такі дії:

source: Conversions from and to the reference currency (euro).
de: Umrechnungen von und in die Referenzwährung (Euro).
pt_br: As conversões de e para a moeda de referência (euro).
uk: Пряме і зворотне перетворення з однієї грошової одиниці у іншу (євро).

source: Systematic rounding of the displayed result, but computations done internally with the precision of the mathematical libraries.
de: Angezeigte Werte werden systematisch gerundet, intern wird aber mit der Genauigkeit der mathematischen Bibliotheken gerechnet.
pt_br: O arredondamento sistemático do resultado apresentado, se bem que os cálculos são feitos internamente com a precisão das bibliotecas matemáticas.
uk: Автоматичне округлення показаних результатів, хоча обчислення виконуються з точністю, з якою їх здатні виконувати математичні бібліотеки системи.

source: Usual additions, subtractions, multiplications and divisions.
de: Übliche Additionen, Subtraktionen, Multiplikationen und Divisionen.
pt_br: As operações normais de soma, subtração, multiplicação e divisão.
uk: Звичайні дії з додавання, віднімання, множення і ділення.

source: Apply a percentage, add a percentage, or subtract a percentage.
de: Prozentwerte anwenden, hinzufügen oder abziehen.
pt_br: Aplicar, adicionar ou subtrair uma percentagem.
uk: Взяття відсотків, додавання відсотків і віднімання відсотків.

source: Possibility to store values in an intermediate memory, or use that memory as a running total.
de: Werte können in einen Zwischenspeicher geladen werden und dieser Speicher kann zur Aufsummierung verwendet werden.
pt_br: A possibilidade de guardar os números em uma memória intermediária ou de usar essa memória como um subtotal.
uk: Збереження значень у тимчасовій пам’яті або використання цієї пам’яті для обчислення суми.

source: Here are some limitations of &keurocalc;:
de: Dies sind einige Einschränkungen von &keurocalc;:
pt_br: Aqui estão algumas limitações do &keurocalc;:
uk: Ось деякі з обмежень &keurocalc;:

source: No parenthesized or complex expressions.
de: Keine Klammerausdrücke oder komplexe Ausdrücke.
pt_br: Não suporta expressões complexas ou entre parênteses.
uk: Не можна обчислювати складні вирази або вирази з дужками.

source: Some roundings go wrong due to the limitations of the mathematical library.
de: Einige Rundungen sind fehlerhaft, das liegt an Einschränkungen der verwendeten mathematischen Bibliothek.
pt_br: Alguns arredondamentos correm mal devido às limitações da biblioteca matemática.
uk: Іноді округлення може призвести до не зовсім точних результатів через обмеження математичної бібліотеки.

source: Inflationist currencies cannot be handled due to limited display size. However, with the change to the new Turkish lira and the removal of six zeroes in that currency, it is not a practical problem anymore.
de: Inflationswährungen können wegen der begrenzten Größe der Anzeige nicht verarbeitet werden. Durch den Wechsel zur neuen türkischen Lira, bei der sechs Nullen in dieser Währung gestrichen werden, ist das auch kein wirkliches Problem mehr.
pt_br: As moedas inflacionistas não poderão ser tratadas, devido a um tamanho limitado na visualização. Contudo, com a mudança para a nova Lira Turca e a remoção dos seis zeros dessa moeda, isto já não é mais um problema.
uk: У програмі важко працювати з сильно знеціненими валютами, оскільки розміри ділянки показу є обмеженими. Але з переходом на нову турецьку ліру і зменшенням її грошових значень на шість порядків проблему має бути усунуто.

source: &keurocalc; never guarantees the exactness of the exchange rates nor the accuracy of the result. You are always invited to verify your computations by some other means. As the <link linkend="credits">license</link> agreement states, there's no liability of the authors if the results are not correct or as expected. Also, please notice that the variable exchange rates are downloaded in an unencrypted and therefore insecure manner from the data sources (European Central Bank and Time Genie). Some <quote>man-in-the-middle</quote> attacker may confuse &keurocalc; by forging exchange rates. More simply, a transmission error is always possible.
de: &keurocalc; gibt keine Garantie für die Genauigkeit der Wechselkurse noch für die Richtigkeit der Ergebnisse. Sie sollten die Berechnungen immer auf anderen Wegen überprüfen. Wie in der <link linkend="credits">Lizenz</link> gesagt, sind die Autoren nicht dafür verantwortlich, wenn Ergebnisse falsch oder nicht wie erwartet sind. Außerdem werden die aktuellen variablen Wechselkurse durch eine unverschlüsselte und daher unsichere Verbindung von den Datenquellen (Europäische Zentralbank und Time Genie) heruntergeladen. <quote>Man-in-the-middle</quote>-Angriffe können &keurocalc; durcheinander bringen und es können jederzeit Übertragungsfehler auftreten.
pt_br: O &keurocalc; nunca garante a exatidão das taxas de câmbio nem a precisão do resultado. Você está sempre convidado a verificar os seus cálculos de outra forma qualquer. Como o acordo da <link linkend="credits">licença</link> diz, não existe nenhuma culpabilidade sobre os autores se os resultados não forem corretos ou como seriam de esperar. Do mesmo modo, repare que as taxas de câmbio variáveis são obtidas de uma forma não-criptografada e, como tal insegura, das fontes de dados (o Banco Central Europeu e o Time Genie). Algum ataque do tipo <quote>homem-no-meio</quote> poderá confundir o &keurocalc;, forjando as taxas de câmbio. De forma mais simples, um erro de transmissão é sempre possível.
uk: &keurocalc; не гарантує ні точності обмінних курсів, ні точності отриманих результатів. Завжди варто перевірити ваші обчислення у якийсь інший спосіб. Як зазначено у <link linkend="credits">ліцензії</link> до програми, автори програми не нестимуть відповідальності, якщо отриманий вами за допомогою програми результат буде неправильним або не таким, як ви очікували. Крім того, будь ласка, зауважте, що дані про обмінні курси звантажуються програмою у незашифрованому, а отже не у безпечному форматі з сайтів джерел даних (Європейського Центрального Банка та Time Genie). Зловмисні атаки шляхом <quote>втручання</quote> можуть призвести до того, що &keurocalc; буде повідомлено неправильні курси валют. Простішою причиною можливих помилок, може бути помилка під час передавання даних.

source: Using &keurocalc;
de: &keurocalc; verwenden
pt_br: Usar o &keurocalc;
uk: Користування &keurocalc;

source: Performing Conversions
de: Währungsumrechnungen durchführen
pt_br: Efetuar Conversões
uk: Виконання перетворення

source: To convert 1000 Belgian francs into euros
de: Umrechnung von 1000 belgischen Franc in Euro
pt_br: Para converter 1 000 Francos Belgas em Euros
uk: Щоб дізнатися вартість 1000 бельгійських франків у євро

source: Select the <guilabel>BEF - Belgian franc</guilabel> (<foreignphrase>francs belges</foreignphrase>) item in the currencies drop down list on the bottom. If that choice is not available, press the <guibutton>Settings...</guibutton> button and select <guilabel>Euro, no network access (fixed rates only)</guilabel> to make the correct rates list appear.
de: Wählen Sie den Eintrag <guilabel>BEF - Belgische Franc</guilabel> (<foreignphrase>francs belges</foreignphrase>) im Auswahlfeld für Währungen. Kann dieser Eintrag nicht ausgewählt werden, drücken Sie den Knopf <guibutton>Einstellungen ...</guibutton> und wählen <guilabel>Euro, kein Netzwerkzugriff (nur feste Kurs)</guilabel>, damit die Liste mit den richtigen Kursen angezeigt wird.
pt_br: Selecione o item <guilabel>BEF - Franco belga</guilabel> (<foreignphrase>francs belges</foreignphrase>) na lista de moedas abaixo. Se esta opção não estiver disponível, clique no botão <guibutton>Configurações...</guibutton> e selecione <guilabel>Euro, sem acesso à rede (taxas fixas apenas)</guilabel> para fazer com que a lista de moedas correta apareça.
uk: Оберіть пункт <guilabel>BEF - Бельгійський франк</guilabel> (<foreignphrase>francs belges</foreignphrase>) у спадному списку, розташованому у нижній частині вікна програми. Якщо цього пункту у списку немає, натисніть кнопку <guibutton>Параметри...</guibutton> і позначте пункт <guilabel>Євро, немає доступу до мережі (фіксовані ставки)</guilabel>, щоб програма показала потрібний список курсів.

source: Type <userinput>1000</userinput> on the keyboard or use the corresponding numerical buttons. The digits appear while you are typing them in the <guilabel>Input</guilabel> display. If you make a mistake while typing the digits use the &Backspace; key or the <guibutton>&lt;-</guibutton> button.
de: Geben Sie <userinput>1000</userinput> über die Tastatur oder mit den entsprechenden Knöpfen für Zahlen ein. Die Ziffern erscheinen sofort im Feld <guilabel>Eingabe</guilabel>. Um Fehler bei der Eingabe der Ziffern zu korrigieren, verwenden Sie die Taste &Backspace; oder den Knopf <guibutton>&lt;-</guibutton>.
pt_br: Digite <userinput>1000</userinput> no teclado ou use os botões numéricos correspondentes. Os algarismos vão aparecendo à medida que os vai escrevendo no campo <guilabel>Entrada</guilabel>. Se você cometeu algum erro ao digitar os algarismos, use a tecla &Backspace; ou o botão <guibutton>&lt;-</guibutton>.
uk: Введіть <userinput>1000</userinput> за клавіатури або скористайтеся кнопками з цифрами у вікні програми. Після введення цифр вони з’являтимуться на екрані області <guilabel>Ввід</guilabel>. Якщо ви зробите помилку під час введення цифр, ви можете скористатися для її виправлення клавішею &Backspace; або кнопкою <guibutton>&lt;-</guibutton>.

source: Press the <guibutton>FB</guibutton> button or the <keycap>F</keycap> key. In fact, any key that is not already reserved for some other usage will validate the input as a number expressed in the currency, so <keycap>B</keycap> or <keycap>X</keycap> would have worked as well.
de: Drücken Sie den Knopf <guibutton>FB</guibutton> oder die Taste <keycap>F</keycap>. Tatsächlich wird mit jeder Taste, der nicht bereits eine andere Funktion zugewiesen wurde, die Eingabe als Zahl in der Währung ausgewertet, daher funktionieren <keycap>B</keycap> or <keycap>X</keycap> ebenfalls.
pt_br: Pressione o botão <guibutton>FB</guibutton> ou na tecla <keycap>F</keycap>. De fato, qualquer tecla que não tenha já sido reservada para outro uso qualquer irá validar o valor inserido como um número expresso na moeda, por isso, o <keycap>B</keycap> ou o <keycap>X</keycap> teriam também funcionado.
uk: Натисніть кнопку <guibutton>FB</guibutton> або клавішу <keycap>F</keycap>. Фактично, з будь-якою клавішею, з якою ще не було пов’язано певної дії, можна скористатися для прив’язки введеного числа до певної валюти, отже ви можете скористатися і клавішами <keycap>B</keycap> і <keycap>X</keycap>.

source: Read the result in the <guilabel>Result</guilabel> display on the right: 24.79 € or 24,79 € according to our locale settings.
de: Im Feld <guilabel>Ergebnis</guilabel> sehen Sie dann rechts 24.79 € or 24,79 € entsprechend Ihrer Regionaleinstellung.
pt_br: Leia o resultado no campo <guilabel>Resultado</guilabel> à direita: 24.79 € ou 24,79 €, de acordo com a sua configuração regional.
uk: Прочитайте результат у полі <guilabel>Результат</guilabel>, розташованому праворуч: 24.79 € або 24,79 €, відповідно до налаштувань локалі вашої системи.

source: To convert 25 euros into Belgian francs
de: Umrechnung von 25 Euro in belgischen Franc
pt_br: Para converter 25 Euros em Francos Belgas
uk: Щоб дізнатися вартість 25 євро у бельгійських франках
