Repository: netrunner-debian-kde-extras/keurocalc
Catalog: doc/*.po
Languages: de, pt_br, uk

source: Official rounding rules
de: Offizielle Rundungsregeln
pt_br: Regras oficiais de arredondamento
uk: Офіційні правила заокруглення

source: The EU conversion rules or other official conversion rules are used. It means that the result is rounded to the next unit for currencies like the Japanese yen or the Italian lira, and rounded to the next hundredth of unit (<quote>cents</quote>) for currencies like the euro or the dollar.
de: Es werden Umwandlungsregeln der EU oder andere offizielle Rundungsregeln verwendet. &ie; das Ergebnis wird zur nächsten ganzen Einheit von Währungen wie dem japanischen Yen oder der italienischen Lira und zur nächsten 1/100 der Einheit (<quote>Cent</quote>) für Währungen wie dem Euro oder dem Dollar gerundet.
pt_br: São usadas as regras de conversão da UE ou as outras regras oficiais de conversão. Isto significa que o resultado é arredondado para a próxima unidade para as moedas como o Iene japonês ou a Lira italiana, ou arredondado ao próximo centésimo de unidade (<quote>cêntimos</quote>) para as moedas como o euro ou o dólar.
uk: Використовуватимуться правила перетворення ЄС або інші офіційні правила перетворення. Це означає, що результат буде округлено до найближчого значення грошової одиниці для валют на зразок японської єни або італійської ліри або округлено до найближчого значення у сотих долях грошової одиниці (<quote>копійок</quote>) для валют на зразок євро або долара.

source: For example, 158.323 yen would be rounded to 158 yen. 12.537 euro would be rounded to 12.54 euro.
de: 158,323 Yen werden zum Beispiel zu 158 Yen und 12,537 € zu 12,54 € gerundet.
pt_br: Por exemplo, 158,323 ienes seriam arredondados para 158 ienes. 12,537 euros seriam arredondados para 12,54 euros.
uk: Наприклад, 158,323 єн буде округлено до 158 єн. 12,537 євро буде округлено до 12,54 євро.

source: Smallest coin method
de: Methode für kleinsten Wert
pt_br: Método da menor moeda
uk: Метод найменшої монети

source: The result is rounded to the next value of the smallest coin that circulates in the country that uses that currency. For disappeared currencies like the Italian lira, it uses the smallest coin that used to circulate before the currency has been withdrawn: in the case of the Italian lira, it was the 50 liras coin.
de: Das Ergebnis wird zum nächsten Wert der kleinsten Münze gerundet, die im Land mit dieser Währung benutzt wird. Bei veralteten Währungen wie der italienischen Lira wird zur kleinsten verwendeten Münze gerundet, ehe die Währung zurückgezogen wurde: Bei der italienischen Lira war das die 50 Lira-Münze.
pt_br: O resultado é arredondado para o valor mais próximo da menor moeda que circular no país que usa essa moeda. Para as moedas desaparecidas como a Lira italiana, ele usa a moeda menor que costumava circular antes de a moeda ter sido retirada: no caso da Lira italiana, era a moeda de 50 liras.
uk: Результат буде округлено до найближчого значення у найдрібніших монетах, які знаходяться у обігу у країні, де використовується ця грошова одиниця. Для валют, які було вилучено з обігу, на зразок італійської ліри, буде використано найдрібнішу монету, яка знаходилася у обігу до вилучення валюти: у випадку ліри, це монета у 50 лір.

source: For example, 1235.9 Italian liras would be rounded to 1250 liras. 39.45 Norwegian crowns would be rounded to 39.50 crowns.
de: 1235,9 italienische Lira werden zum Beispiel zu 1250 Lira und 39,45 norwegische Kronen zu 39,50 Kronen gerundet.
pt_br: Por exemplo, 1235,9 liras italianas seriam arredondadas para 1250 liras. As 39,45 coroas norueguesas seriam arredondados para 39,50.
uk: Наприклад, 1235,9 італійських лір буде округлено до 1250 лір. 39,45 норвезьких крон буде округлено до 39,50 крон.

source: We lack information about the smallest coins that exist in every country. Please send a bug report if &keurocalc; uses an incorrect value for the smallest available coin in your country, and we will enter that information.
de: Es fehlen Informationen über die kleinsten Münzeinheiten aller Länder. Schicken Sie bitte einen Fehlerbericht, wenn &keurocalc; einen falschen Wert der kleinsten verfügbaren Münzeinheit in Ihrer Währung benutzt. Diese Information wird dann ins Programm eingefügt.
pt_br: Faltam informações sobre as moedas menores que existem em cada país. Por favor envie um relatório de erro se o &keurocalc; usar um valor incorreto para a menor moeda disponível para o seu país, e essa informação será inserida.
uk: Авторам програми не вистачає даних щодо найдрібніших монет, які знаходяться у обігу у різних країнах. Будь ласка, надішліть повідомлення про помилку, якщо &keurocalc; використовує неправильні значення для найдрібніших монет, які перебувають у обігу у вашій країні, — автори негайно виправлять помилку.

source: No rounding at all
de: Nicht runden
pt_br: Sem arredondamento
uk: Зовсім без заокруглення

source: The computed value is displayed unchanged, as a floating point number.
de: Der berechnete Wert wird unverändert als Gleitkommazahl angezeigt.
pt_br: O valor calculado é mostrado sem alterações, como um número de vírgula flutuante.
uk: Обчислене значення буде показано у незмінному вигляді, як число з плаваючою комою.

source: Look and feel
de: Erscheinungsbild
pt_br: Aparência e comportamento
uk: Вигляд і поведінка

source: This setting defines the appearance and behavior of &keurocalc;. The following options are available:
de: Diese Einstellungen bestimmen das Erscheinungsbild und Verhalten von &keurocalc;. Die folgenden Einstellungen können ausgewählt werden:
pt_br: Esta opção define a aparência e comportamento do &keurocalc;. Estão disponíveis as seguintes opções:
uk: За допомогою цих параметрів можна визначити вигляд і поведінку &keurocalc;. Ви можете скористатися такими параметрами:

source: Display color
de: Anzeigenfarbe
pt_br: Cor da tela
uk: Колір показу

source: The background color of the display areas (both input and result). To change the background color, click on <guibutton>Change...</guibutton>. This opens the standard &kde; color selection dialog. Choose a new color, then press <guibutton>OK</guibutton> to validate the new choice.
de: Die Hintergrundfarbe der Anzeigenbereiche für die Eingabe und das Ergebnis. Um eine andere Hintergrundfarbe einzustellen, klicken Sie auf <guibutton>Ändern ...</guibutton> Damit wird der &kde;-Standarddialog zur Farbauswahl geöffnet. Wählen Sie in diesem Dialog eine neue Farbe und drücken Sie <guibutton>OK</guibutton>, um die Einstellung zu übernehmen.
pt_br: A cor de fundo das áreas de visualização (tanto dos dados de entrada como do resultado). Para mudar a cor de fundo, clique em <guibutton>Modificar...</guibutton>. Isto irá abrir a janela normal do &kde; para selecionar cores. Escolha uma cor nova e, quando terminar, pressione <guibutton>OK</guibutton> para validar a nova escolha.
uk: Колір тла ділянок показу (вводу і результату). Щоб змінити колір тла, натисніть кнопку <guibutton>Змінити...</guibutton>. У відповідь середовище відкриє стандартне діалогове вікно вибору кольору &kde;. Оберіть у ньому новий колір, а потім натисніть кнопку <guibutton>Гаразд</guibutton>, щоб підтвердити ваш вибір.

source: Enable splash screen
de: Startbildschirm aktivieren
pt_br: Ativar a tela inicial
uk: Увімкнути екран заставки

source: Uncheck this box if you do not want to initial picture to appear when &keurocalc; starts.
de: Schalten sie diese Einstellung aus, wenn Sie den Startbildschirm bei Aufruf von &keurocalc; nicht anzeigen möchten.
pt_br: Desligue esta opção se não quiser que apareça a imagem inicial, quando iniciar o &keurocalc;.
uk: Зніміть позначку з цього пункту, якщо ви не бажаєте бачити вікно вітання під час запуску &keurocalc;.

source: Credits and License
de: Mitwirkende und Lizenz
pt_br: Créditos e licença
uk: Подяки і ліцензія

source: Program copyright 2001-2012 the &keurocalc; developers:
de: Copyright des Programms 2001-2012: Die &keurocalc;-Entwickler:
pt_br: Direitos autorais do programa 2001-2012, os desenvolvedores do &keurocalc;:
uk: Авторські права на програму належать розробникам &keurocalc;:, 2001–2012:

source: Éric Bischoff <email>ebischoff@_NOSPAM_nerim.net</email> - design and implementation
de: Éric Bischoff <email>ebischoff@_NOSPAM_nerim.net</email> - Entwurf und Implementierung
pt_br: Éric Bischoff <email>ebischoff@_NOSPAM_nerim.net</email> - desenho e implementação
uk: Éric Bischoff <email>ebischoff@_NOSPAM_nerim.net</email> — розробка і втілення зовнішнього вигляду

source: Gil Gross <email>ptit.ours@_NOSPAM_gmail.com</email> - additional functionality
de: Gil Gross <email>ptit.ours@_NOSPAM_gmail.com</email> - Zusätzliche Funktionalität
pt_br: Gil Gross <email>ptit.ours@_NOSPAM_gmail.com</email> - funcionalidades adicionais
uk: Gil Gross <email>ptit.ours@_NOSPAM_gmail.com</email> — додаткові функції

source: Melchior Franz <email>a8603365@_NOSPAM_unet.univie.ac.at</email> - design and testing
de: Melchior Franz <email>a8603365@_NOSPAM_unet.univie.ac.at</email> - Aussehen und Tests
pt_br: Melchior Franz <email>a8603365@_NOSPAM_unet.univie.ac.at</email> - desenho e testes
uk: Melchior Franz <email>a8603365@_NOSPAM_unet.univie.ac.at</email> — зовнішній вигляд і тестування

source: Bas Willems <email>cybersurfer@_NOSPAM_euronet.nl</email> - graphical artwork
de: Bas Willems <email>cybersurfer@_NOSPAM_euronet.nl</email> - Grafische Gestaltung
pt_br: Bas Willems <email>cybersurfer@_NOSPAM_euronet.nl</email> - artes gráficas
uk: Bas Willems <email>cybersurfer@_NOSPAM_euronet.nl</email> — створення графічних елементів

source: Documentation copyright 2001-2012 Éric Bischoff <email>ebischoff@_NOSPAM_nerim.net</email>.
de: Copyright der Dokumentation 2001-2012 Éric Bischoff <email>ebischoff@_NOSPAM_nerim.net</email>.
pt_br: Direitos autorais da documentação 2001-2012 Éric Bischoff <email>ebischoff@_NOSPAM_nerim.net</email>.
uk: Авторські права на документацію належать Éric Bischoff <email>ebischoff@_NOSPAM_nerim.net</email>, 2001–2012.

source: Documentation reviewed by &Philip.Rodrigues; &Philip.Rodrigues.mail;.
de: Korrekturlesen der Dokumentation durch &Philip.Rodrigues; &Philip.Rodrigues.mail;.
pt_br: Documentação revista por &Philip.Rodrigues; &Philip.Rodrigues.mail;.
uk: Автор перегляду документації &Philip.Rodrigues; &Philip.Rodrigues.mail;.

source: CREDIT_FOR_TRANSLATORS
de: <para>Übersetzung Burkhard Lück <email>lueck@hube-lueck.de</email></para>
pt_br: <para>Tradução de Marcus Gama <email>marcus.gama@gmail.com</email></para>
uk: <para>Переклад українською: Юрій Чорноіван <email>yurchor@ukr.net</email></para>

source: Installation
pt_br: Instalação
uk: Встановлення

source: How to obtain &keurocalc;
de: Bezugsquellen von &keurocalc;
pt_br: Como obter o &keurocalc;
uk: Як отримати &keurocalc;

source: &keurocalc; is part of the <ulink url="http://extragear.kde.org/">KDE extragear-utils</ulink> package. The latest version of &keurocalc; can be downloaded from its <ulink url="http://opensource.bureau-cornavin.com/keurocalc/">home page</ulink>.
de: &keurocalc; ist Teil des &kde;-Moduls <ulink url="http://extragear.kde.org/">extragear-utils</ulink>. Die neueste Version von &keurocalc; kann von der <ulink url="http://opensource.bureau-cornavin.com/keurocalc/">Projektseite</ulink> heruntergeladen werden.
pt_br: O &keurocalc; faz parte do pacote <ulink url="http://extragear.kde.org/">extragear-utils do KDE</ulink>. A última versão do &keurocalc; pode ser obtida na sua <ulink url="http://opensource.bureau-cornavin.com/keurocalc/">página pessoal</ulink>.
uk: &keurocalc; є частиною пакунка <ulink url="http://extragear.kde.org/">KDE extragear-utils</ulink>. Найостаннішу версію &keurocalc; можна звантажити з <ulink url="http://opensource.bureau-cornavin.com/keurocalc/">домашньої сторінки програми</ulink>.

source: Requirements
de: Voraussetzungen
pt_br: Requisitos
uk: Вимоги

source: In order to successfully use &keurocalc;, you need &kde; 4.0.
uk: Для того, щоб програма &keurocalc; працювала належним чином, вам слід встановити &kde; 4.0.

source: All required libraries can be found on <ulink url="ftp://ftp.kde.org">ftp.kde.org</ulink>, the &FTP; site of the &kde; project.
de: Alle erforderlichen Bibliotheken finden Sie auf <ulink url="ftp://ftp.kde.org">ftp.kde.org</ulink>, dem &FTP;-Server des &kde;-Projekts.
pt_br: Todas as bibliotecas necessárias podem ser obtidas em <ulink url="ftp://ftp.kde.org">ftp.kde.org</ulink>, o 'site' &FTP; do projeto &kde;.
uk: Всі потрібні бібліотеки можна знайти на <ulink url="ftp://ftp.kde.org">ftp.kde.org</ulink>, сайті &FTP; проекту &kde;.

source: Compilation and Installation
de: Kompilierung und Installation
pt_br: Compilação e instalação
uk: Збирання і встановлення

source: In order to compile and install &keurocalc; on your system, type the following in the base directory of the &keurocalc; distribution:
de: Um &keurocalc; auf Ihrem System zu kompilieren und installieren, benutzen Sie folgenden Befehl im Basisordner des &keurocalc;-Pakets:
pt_br: Para poder compilar e instalar o &keurocalc; no seu sistema, digite o seguinte na pasta base da distribuição do &keurocalc;:
uk: Щоб зібрати і встановити &keurocalc; у вашій системі, наберіть і виконайте такі команди у основній теці видобутого пакунка &keurocalc;:

source: Since cmake autodetects your system settings, you should have no trouble compiling &keurocalc;. Should you run into problems please report them to &keurocalc;'s authors.
de: Da CMake die Einstellungen Ihres Systems automatisch erkennt, sollte es beim Kompilieren von &keurocalc; keine Schwierigkeiten geben.Sollten dennoch Probleme auftauchen, wenden Sie sich bitte an die Autoren von &keurocalc;.
pt_br: Uma vez que o CMake detecta automaticamente a configuração do seu sistema, não deverá ter problemas ao compilar o &keurocalc;. Se tiver problemas, por favor, comunique-os aos autores do &keurocalc;.
uk: Оскільки cmake автоматично визначає параметри вашої системи, у вас не повинно виникнути проблем зі збиранням &keurocalc;. Якщо такі проблеми все ж виникнуть, повідомте про них авторам &keurocalc;.

source: In order to successfully use &keurocalc;, you need &kde; 4.
de: Um &keurocalc; erfolgreich einsetzen zu können, benötigen Sie &kde; 4.
pt_br: Para poder usar com sucesso o &keurocalc;, você precisa do &kde; 4.

source: &Alt; <keycap>A</keycap>
de: &Alt; <keycap>H</keycap>
